# SQL Analytics for Northwind Traders

In this project, I'm working with the Northwind database, a sample database originally provided by Microsoft for its Access Database Management System. It's based on a fictitious company named "Northwind Traders" and contains data on customers, orders, products, suppliers, and other aspects of the business.

I've chosen to work with a [PostgreSQL version of Northwind](https://github.com/pthom/northwind_psql/tree/master) for this analysis.

My goal is to extract meaningful business insights using advanced SQL techniques such as window functions and Common Table Expressions (CTEs). Through this project, I aim to demonstrate my SQL skills by answering these key business questions:

1. [Which employees generate the most revenue?](#section1)
2. [How are sales accumulating over time?](#section2)
3. [What is the monthly sales growth pattern?](#section3)

For reference, here's the schema diagram from the database's [GitHub page](https://github.com/pthom/northwind_psql/tree/master):

![ER Diagram](files/ER.png)

In [1]:
%load_ext sql
from sqlalchemy import create_engine
db_url = "postgresql://postgres:postgres@localhost:55432/northwind"
engine = create_engine(db_url)
%sql engine

%config SqlMagic.displaylimit = None

displaylimit: Value None will be treated as 0 (no limit)

<a id='section1'></a>
### Task 1: Which employees generate the most revenue?

In this analysis, I rank employees by their total sales amounts to identify top performers.

In [2]:
%%sql
WITH total_sales AS (
    SELECT
        e.employee_id,
        e.first_name || ' ' || e.last_name AS full_name,
        ROUND(
            SUM(od.unit_price * (1 - od.discount) * od.quantity) :: DECIMAL,
            2) AS total_sales
    FROM employees e
    JOIN orders o ON e.employee_id = o.employee_id
    JOIN order_details od ON o.order_id = od.order_id
    GROUP BY e.employee_id
)
SELECT
    *,
    RANK() OVER (ORDER BY total_sales DESC)
FROM total_sales;

Running query in 'postgresql://postgres:***@localhost:55432/northwind'

9 rows affected.

+-------------+------------------+-------------+------+
| employee_id |    full_name     | total_sales | rank |
+-------------+------------------+-------------+------+
|      4      | Margaret Peacock |  232890.85  |  1   |
|      3      | Janet Leverling  |  202812.84  |  2   |
|      1      |  Nancy Davolio   |  192107.60  |  3   |
|      2      |  Andrew Fuller   |  166537.76  |  4   |
|      8      |  Laura Callahan  |  126862.28  |  5   |
|      7      |   Robert King    |  124568.23  |  6   |
|      9      |  Anne Dodsworth  |   77308.07  |  7   |
|      6      |  Michael Suyama  |   73913.13  |  8   |
|      5      | Steven Buchanan  |   68792.28  |  9   |
+-------------+------------------+-------------+------+

<a id='section2'></a>
### Task 2: How are sales accumulating over time?

Here I calculate the running total of sales per month to visualize the sales trajectory.

In [3]:
%%sql
WITH monthly_sales AS (
    SELECT
        DATE_TRUNC('month', o.order_date) AS month,
        SUM(od.unit_price * (1 - od.discount) * od.quantity) AS total_sales
    FROM orders o
    JOIN order_details od ON o.order_id = od.order_id
    GROUP BY DATE_TRUNC('month', o.order_date)
)
SELECT
    month,
    ROUND(
        SUM(total_sales) OVER (ORDER BY month) :: DECIMAL,
        2) AS running_total
FROM monthly_sales
ORDER BY month;

Running query in 'postgresql://postgres:***@localhost:55432/northwind'

23 rows affected.

+---------------------------+---------------+
|           month           | running_total |
+---------------------------+---------------+
| 1996-07-01 00:00:00+00:00 |    27861.90   |
| 1996-08-01 00:00:00+00:00 |    53347.17   |
| 1996-09-01 00:00:00+00:00 |    79728.57   |
| 1996-10-01 00:00:00+00:00 |   117244.30   |
| 1996-11-01 00:00:00+00:00 |   162844.34   |
| 1996-12-01 00:00:00+00:00 |   208083.97   |
| 1997-01-01 00:00:00+00:00 |   269342.04   |
| 1997-02-01 00:00:00+00:00 |   307825.68   |
| 1997-03-01 00:00:00+00:00 |   346372.90   |
| 1997-04-01 00:00:00+00:00 |   399405.85   |
| 1997-05-01 00:00:00+00:00 |   453187.14   |
| 1997-06-01 00:00:00+00:00 |   489549.94   |
| 1997-07-01 00:00:00+00:00 |   540570.80   |
| 1997-08-01 00:00:00+00:00 |   587858.47   |
| 1997-09-01 00:00:00+00:00 |   643487.71   |
| 1997-10-01 00:00:00+00:00 |   710236.94   |
| 1997-11-01 00:00:00+00:00 |   753770.74   |
| 1997-12-01 00:00:00+00:00 |   825169.17   |
| 1998-01-01 00:00:00+00:00 |   919391.28   |
| 1998-02-01 00:00:00+00:00 |   1018806.57  |
| 1998-03-01 00:00:00+00:00 |   1123660.73  |
| 1998-04-01 00:00:00+00:00 |   1247459.41  |
| 1998-05-01 00:00:00+00:00 |   1265793.04  |
+---------------------------+---------------+

<a id='section3'></a>
### Task 3: What is the monthly sales growth pattern?

In [4]:
%%sql
WITH monthly_sales AS (
    SELECT
        EXTRACT('year' from o.order_date) AS year,
        EXTRACT('month' from o.order_date) AS month,
        SUM(od.unit_price * (1 - od.discount) * od.quantity) AS total_sales
    FROM orders o
    JOIN order_details od ON o.order_id = od.order_id
    GROUP BY EXTRACT('year' from o.order_date), EXTRACT('month' from o.order_date)
),
two_monthly AS (
    SELECT
        year,
        month,
        total_sales,
        LAG(total_sales) OVER (ORDER BY year, month) AS previous_total_sales
    FROM monthly_sales
)
SELECT
    year,
    month,
    ROUND(
        (100 * (total_sales - previous_total_sales) / previous_total_sales)::DECIMAL,
        2) AS growth_rate
FROM two_monthly;

Running query in 'postgresql://postgres:***@localhost:55432/northwind'

23 rows affected.

+------+-------+-------------+
| year | month | growth_rate |
+------+-------+-------------+
| 1996 |   7   |     None    |
| 1996 |   8   |    -8.53    |
| 1996 |   9   |     3.52    |
| 1996 |   10  |    42.21    |
| 1996 |   11  |    21.55    |
| 1996 |   12  |    -0.79    |
| 1997 |   1   |    35.41    |
| 1997 |   2   |    -37.18   |
| 1997 |   3   |     0.17    |
| 1997 |   4   |    37.58    |
| 1997 |   5   |     1.41    |
| 1997 |   6   |    -32.39   |
| 1997 |   7   |    40.31    |
| 1997 |   8   |    -7.32    |
| 1997 |   9   |    17.64    |
| 1997 |   10  |    19.99    |
| 1997 |   11  |    -34.78   |
| 1997 |   12  |    64.01    |
| 1998 |   1   |    31.97    |
| 1998 |   2   |     5.51    |
| 1998 |   3   |     5.47    |
| 1998 |   4   |    18.07    |
| 1998 |   5   |    -85.19   |
+------+-------+-------------+